;; 2.1

;; page 8
R> [attributes 'mdeaths]
((1974.0d0 1979.91666666667d0 12.0d0) "ts")
((:NAMES "tsp" "class"))
R> [print [_attributes 'mdeaths]]
;R# $tsp
;R# [1] 1974.000 1979.917   12.000
;R# 
;R# $class
;R# [1] "ts"
;R# 
((1974.0d0 1979.91666666667d0 12.0d0) "ts")
((:NAMES "tsp" "class"))

;; page 9
R> [> '(2.9 3.4 3.4 3.7 3.7 2.8 2.5 2.4 2.4) 3]
(NIL T T T T NIL NIL NIL NIL)

R> [%% 32 3]
2

[search]

;;[rpois 3 2]
